october_amazon_with_comment/app/views/products/show.html.erb


<% @product.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = $1  [["product_id", 1]]