october_amazon_with_comment/app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "First body!"], ["product_id", 1], ["created_at", "2015-11-04 00:35:34.065862"], ["updated_at", "2015-11-04 00:35:34.065862"]]
---
  def create
    comment_params = params.require(:comment).permit(:body)
    @product = Product.find params[:product_id]
    @comment = Comment.new comment_params
    @comment.product = @product
    if @comment.save