october_amazon_with_comment/app/controllers/products_controller.rb

  def create
    product_params = params.require(:product).permit([:title, :price, :description])
    @product       = Product.new product_params
    @product.user  = current_user
    if @product.save
---
INSERT INTO "products" ("title", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asfkdjdasklfdjskfl"], ["price", "1000.0"], ["description", "dajfkjsdfklf"], ["created_at", "2015-11-03 23:38:30.350337"], ["updated_at", "2015-11-03 23:38:30.350337"]]

  def show
    @product = Product.find params[:id]
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]